In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.options.display.float_format = '{:,.3f}'.format
%matplotlib inline

In [12]:
%cd d:\Documents\db\data_triatlon
!ls

d:\Documents\db\data_triatlon
colombia_exports.csv
colombia_imports.csv
country_names.csv
groups_sitc_rev2.csv
products_sitc_rev2.csv

In [13]:
df_exports=pd.read_csv('colombia_exports.csv', sep='|')
df_exports.drop(['Unnamed: 0'], axis=1, inplace=True)
df_exports.drop(['Unnamed: 0.1'], axis=1, inplace=True)
df_exports.isna().any()
df_exports.rename(columns={'sitc4':'sitc'}, inplace=True)
df_exports.rename(columns={'dest':'pais'}, inplace=True)
df_exports

        year origin pais  sitc     export_val
0       1962    col  civ  1210     12,000.000
1       1962    col  dza  1210    112,000.000
2       1962    col  egy  2472      6,000.000
3       1962    col  mar  1210    164,000.000
4       1962    col  mar   711      5,000.000
...      ...    ...  ...   ...            ...
389591  2017    col  ury  6635     26,526.500
389592  2017    col  ury  8924      4,285.500
389593  2017    col  ury  8928     25,667.500
389594  2017    col  ury  8972      5,306.000
389595  2017    col  ury  9310 10,063,053.000

[389596 rows x 5 columns]

In [14]:
df_sitc_prod=pd.read_csv('products_sitc_rev2.csv', sep='|')
df_sitc_prod.drop(['Unnamed: 0'], axis=1, inplace=True)
df_sitc_prod.isna().any()
df_sitc_prod

         id  sitc                                               name
0    105722  5722                                 Initiating Devices
1    105838  5838                      Polymerization Ion Exchangers
2    106250  6250  Rubber tires, tire cases, inner and flaps, for...
3    106251  6251                                          Car Tires
4    106280  6280                           Other articles of rubber
..      ...   ...                                                ...
983  909310  9310                          Unclassified Transactions
984  909410  9410                         Miscellaneous Live Animals
985  909610  9610                                      Non-Gold Coin
986  xx0010    10                      Live animals chiefly for food
987  xx0110   110                                               Meat

[988 rows x 3 columns]

In [15]:
df_sitc_group=pd.read_csv('groups_sitc_rev2.csv', sep='|')
df_sitc_group.drop(['Unnamed: 0'], axis=1, inplace=True)
df_sitc_group.isna().any()
df_sitc_group

    id                                           category
0    0     Live animals other than animals of division 03
1    1                         Meat and meat preparations
2    2                     Dairy products and birds' eggs
3    3  Fish, crustaceans, molluscs and preparations t...
4    4                    Cereals and cereal preparations
..  ..                                                ...
60  87    Professional and scientific instruments, n.e.s.
61  88  Photo apparatus, optical goods, watches and cl...
62  89        Miscellaneous manufactured articles, n.e.s.
63  96  Coin (other than gold coin), not being legal t...
64  97  Gold, non-monetary (excluding gold ores and co...

[65 rows x 2 columns]

In [16]:
df_country_names=pd.read_csv('country_names.csv', sep='|')
df_country_names.drop(['Unnamed: 0'], axis=1, inplace=True)
df_country_names.rename(columns={'id_3char':'pais'}, inplace=True)
df_country_names.isna().any()
df_country_names.drop_duplicates()

        id pais          name
0    afago  ago        Angola
1    afbdi  bdi       Burundi
2    afben  ben         Benin
3    afbfa  bfa  Burkina Faso
4    afbwa  bwa      Botswana
..     ...  ...           ...
258  sasur  sur      Suriname
259  saury  ury       Uruguay
260  saven  ven     Venezuela
261  xxwld  wld         World
262  xxxxh  xxa         Areas

[263 rows x 3 columns]

In [17]:
df_imports=pd.read_csv('colombia_imports.csv', '|')
df_imports.drop(['Unnamed: 0'], axis=1, inplace=True)
df_imports.drop(['Unnamed: 0.1'], axis=1, inplace=True)
df_imports.drop(['dest'], axis=1, inplace=True)
df_imports.isna().any()
df_imports.rename(columns={'sitc4':'sitc'}, inplace=True)
df_imports.rename(columns={'origin':'pais'}, inplace=True)
df_imports

        year pais  sitc    export_val
0       1962  civ   712    13,000.000
1       1962  cod  2925     2,000.000
2       1962  cog  2925     2,000.000
3       1962  egy  2631    40,000.000
4       1962  eth  2922     4,000.000
...      ...  ...   ...           ...
560487  2017  ury  5833       231.500
560488  2017  ury  6658     8,658.000
560489  2017  ury  8928     3,816.500
560490  2017  ury  8972       500.000
560491  2017  ury  9310 5,500,539.500

[560492 rows x 4 columns]

In [18]:
# mergin de los dataframes:
df=pd.merge(df_exports, df_sitc_prod, how='inner', on='sitc')
df1=pd.merge(df, df_country_names, how='inner', on='pais')

#renombro y elimino algunas columnas
df1.rename(columns={'name_x':'product', 'name_y':'nombre_pais','pais':'dest'}, inplace=True)
df_clean_exports=df1.drop(['id_x', 'id_y', 'origin'], axis=1)

#reordeno las columnas
df_clean_exports=df_clean_exports[['year', 'dest', 'nombre_pais', 'sitc','product','export_val']]

df_clean_exports['year']=pd.to_datetime(df_clean_exports['year'], format="%Y")
df_clean_exports['year']=pd.DatetimeIndex(df_clean_exports['year']).year
df_clean_exports

,year,dest,nombre_pais,sitc,product,export_val
0,1962,civ,Cote d'Ivoire,1210,Tobacco unmanufactured; tobacco refuse,"12,000.000"
1,1971,civ,Cote d'Ivoire,1210,Tobacco unmanufactured; tobacco refuse,"9,000.000"
2,1972,civ,Cote d'Ivoire,1210,Tobacco unmanufactured; tobacco refuse,"7,000.000"
3,1973,civ,Cote d'Ivoire,1210,Tobacco unmanufactured; tobacco refuse,"22,000.000"
4,1974,civ,Cote d'Ivoire,1210,Tobacco unmanufactured; tobacco refuse,"29,000.000"
...,...,...,...,...,...,...
388059,1997,mnp,Northern Mariana Islands,6542,Woven Frabrics of More Than 85% Wool,"55,770.000"
388060,1999,mnp,Northern Mariana Islands,6542,Woven Frabrics of More Than 85% Wool,"216,156.000"
388061,2001,mnp,Northern Mariana Islands,6542,Woven Frabrics of More Than 85% Wool,"240,122.000"
388062,2004,mnp,Northern Mariana Islands,7525,Computer Peripherals,"2,170.000"
388063,1999,mnp,Northern Mariana Islands,6543,Miscellaneous Wool Woven Fabrics,"42,804.000"

In [19]:
#hago el mismo procedimientos para tener un datframe con los valores de importacion
df_clean_imports=pd.merge(pd.merge(df_imports, df_sitc_prod, how='inner', on='sitc'), df_country_names, how='inner', on='pais')
df_clean_imports.rename(columns={'name_x':'product', 'name_y':'nombre_pais', 'export_val':'import_val', 'pais':'origin'}, inplace=True)
df_clean_imports=df_clean_imports.drop(['id_x', 'id_y'], axis=1)
df_clean_imports=df_clean_imports[['year', 'origin', 'nombre_pais', 'sitc','product','import_val']]
df_clean_imports

,year,origin,nombre_pais,sitc,product,import_val
0,1962,civ,Cote d'Ivoire,712,Coffee Extracts,"13,000.000"
1,1963,civ,Cote d'Ivoire,2925,Planting Seeds and Spores,"16,000.000"
2,1964,civ,Cote d'Ivoire,2925,Planting Seeds and Spores,"26,000.000"
3,1965,civ,Cote d'Ivoire,2925,Planting Seeds and Spores,"2,000.000"
4,1966,civ,Cote d'Ivoire,2925,Planting Seeds and Spores,"2,000.000"
...,...,...,...,...,...,...
559521,2003,mnp,Northern Mariana Islands,8451,Knitted Outerwear,137.000
559522,2006,mnp,Northern Mariana Islands,8451,Knitted Outerwear,"1,420.000"
559523,2007,mnp,Northern Mariana Islands,8433,Dresses,846.000
559524,2006,mnp,Northern Mariana Islands,8434,Skirts,300.000
559525,2002,mnp,Northern Mariana Islands,8424,Men's Jackets,34.000


¿Cuál es el top 10 países a los que Colombia exporta sus productos?:

In [20]:
exp_countriestop10=df_clean_exports.groupby(['nombre_pais'])['export_val'].sum().to_frame().sort_values(by=['export_val'], ascending=False).head(10)
exp_countriestop10

                       export_val
nombre_pais
United States 260,603,708,738.500
World          73,055,836,595.000
Venezuela      42,876,466,095.000
Germany        29,901,242,862.000
China          28,098,899,858.000
Ecuador        27,910,876,776.500
Netherlands    23,378,757,615.500
Spain          22,173,799,276.000
Peru           20,931,290,140.000
Panama         19,772,563,462.000